# Домашнее задание по numpy и pandas

## Часть по pandas

В этом домашнем задании мы продолжим работать с файлом `titanic.csv`, с которым работали на вебинаре и в статье. Откроем файл:

In [13]:
import pandas as pd
import numpy as np

df = pd.read_csv('https://raw.githubusercontent.com/DSFBL/1_python_public/main/lesson_10/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Описание колонок:

**PassengerId** - id пассажира

**Survived** бинарная переменная: выжил пассажирил (1) или нет (0)

**Pclass** - класс пассажира

**Name** - имя пассажира

**Sex** - пол пассажира

**Age** - возраст пассажира

**SibSp** - количество родственников (братьев, сестер, супругов) пассажира на борту

**Parch** - количество родственников (родителей / детей) пассажира на борту

**Ticket** - номер билета

**Fare** - тариф (стоимость билета)

**Cabin** - номер кабины

**Embarked** - порт, в котором пассажир сел на борт (C - Cherbourg, S - Southampton, Q = Queenstown)

Вам нужно написать код, который будет отвечать на вопросы ниже. Проверить себя можно, отправив ответы [в форму](https://forms.gle/9Xk5jChEFPPBLcct5).

### Задание 1

Сколько пассажиров выжило?

In [3]:
df[df['Survived'] == 1].shape[0]

342

### Задание 2

Посчитайте среднее число родственников (братьев, сестр, супругов) на борту и 75% квантиль стоимости билета. Округлите значения до 2 знаков после запятой. Ответ в гугл форму запишите в формате `0.00`

Для округления можно воспользоваться функцией [np.round()](https://docs.scipy.org/doc/numpy-1.13.0/reference/generated/numpy.round_.html)

In [15]:
np.round(df['SibSp'].mean(), 2)

0.52

In [12]:
df['Fare'].quantile(0.75)

31.0

### Задание 3

Сколько пассажирок 3 класса (именно женщин) с возрастом старше среднего было на корабле?

In [22]:
df[(df['Pclass'] == 3) & (df['Sex'] == 'female') & (df['Age'] > df['Age'].mean())].shape[0]

26

### Задание 4

Посчитайте разницу между средней стоимостью билета для женщин и для мужчин. Запишите округленное до 2 знаков после запятой число.

In [27]:
female_fare = df[df['Sex'] == 'female']['Fare'].mean()
female_fare

44.47981783439491

In [29]:
male_fare = df[df['Sex'] == 'male']['Fare'].mean()
male_fare

25.523893414211443

In [31]:
np.round(female_fare - male_fare, 2)

18.96

### Задание 5

Сложите колонки `SibSp` и `Parch`, запишите результат в колонку `Family`. Отсортируйте таблицу по этой колонке по убыванию. Выведите первые 7 строчек. Посмотрите на колонку `Name`. До запятой указана фамилия, после – титул и имя. Запишите в ответ фамилию этой семьи

In [34]:
df['Family'] = df['SibSp'] + df['Parch']
df.sort_values(by='Family', ascending=False).head(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
180,181,0,3,"Sage, Miss. Constance Gladys",female,NaN,8,2,CA. 2343,69.55,NaN,S,10
846,847,0,3,"Sage, Mr. Douglas Bullen",male,NaN,8,2,CA. 2343,69.55,NaN,S,10
792,793,0,3,"Sage, Miss. Stella Anna",female,NaN,8,2,CA. 2343,69.55,NaN,S,10
201,202,0,3,"Sage, Mr. Frederick",male,NaN,8,2,CA. 2343,69.55,NaN,S,10
159,160,0,3,"Sage, Master. Thomas Henry",male,NaN,8,2,CA. 2343,69.55,NaN,S,10
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.55,NaN,S,10
324,325,0,3,"Sage, Mr. George John Jr",male,NaN,8,2,CA. 2343,69.55,NaN,S,10

### Задание 6

Из колонки `Name` выделите имя (первое слово после титула). Запишите имена в отдельную колонку `FirstName`. Пример: для строчки `Braund, Mr. Owen Harris` именем будем считать `Owen`. Воспользуйтесь примером с `apply` с вебинара.

Найдите самое часто встречающееся значение в этой колонке. Запишите его в ответ без кавычек.

In [43]:
def get_first_name(string):
    return string.split(', ')[1].split('. ')[1].split()[0]

In [45]:
df['FirstName'] = df['Name'].apply(get_first_name)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,FirstName
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,Owen
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,John
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,Jacques
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,William

In [48]:
df['FirstName'].value_counts().index[0]

'William'

### Задание 7

Задание со звездочкой :) 

Найдите самое частое женское имя. Запишите его в ответ без кавычек.

**Но!** Если внимательно посмотреть в данные, то имена замужних женщин иногда записываются в формате `Cumings, Mrs. John Bradley (Florence Briggs Thayer)`. По логике из предыдущего задания в колонке `FirstName` будет записано `John`. Создайте новую колонку `FirstNameUpd`, где для примера выше будет записано `Florence`. Отфильтруйте датафрейм так, чтобы в нем остались только женщины, и найдите самое частое значение в этой колонке. Запишите его в ответ без кавычек.

Ниже есть 3 подсказки. Нажмите на них, если хотите посмотреть.


<details><summary>Подсказка 1</summary>
<p>

* Чтобы проверить замужняя ли женщина, проверьте есть ли в строке скобочка (т.к. именно в скобочках указано имя и девичья фамилия)

</p>
</details>

<details><summary>Подсказка 2</summary>
<p>

* Для примера выше чтобы получить имя нужно вырезать `Florence Briggs Thayer` и взять первое слово 

</p>
</details>

<details><summary>Подсказка 3</summary>
<p>

* Вам могут помочь методы работы с поисками подстроки в строке (`find()` и `rfind()`)

</p>
</details>

In [71]:
def get_first_name_upd(string):
    if '(' in string:
        r_index = string.find('(') + 1
        l_index = string.rfind(')') - 1
        return string[r_index:l_index].split()[0]
    else:
        return string.split(', ')[1].split('. ')[1].split()[0]

In [74]:
df['FirstNameUpd'] = df['Name'].apply(get_first_name_upd)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,FirstName,FirstNameUpd
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,Owen,Owen
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,John,Florence
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,Laina,Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,Jacques,Lily
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,William,William

In [77]:
df[df['Sex'] == 'female']['FirstNameUpd'].value_counts().index[0]

'Anna'

## Часть по numpy

Для решения заданий на numpy используйте матрицы, заданные ниже:

In [94]:
a = np.array([[123, 14, -18], [1245, 0, 53]])
b = np.array([[-56, 78], [45, 983], [-12, 15]])

### Задание 8

У Вас есть 2 матрицы a и b. Перемножьте их. Какая размерность будет у итоговой матрицы?

In [99]:
c = a @ b
c

array([[ -6042,  23086],
       [-70356,  97905]])

In [97]:
c.shape

(2, 2)

### Задание 9

Используя матрицу, полученную в предыдущем задании, посчитайте сумму по столбцам. Введите в ответ первое число без пробелов, точек и пр.

In [104]:
c.sum(axis=0)[0]

-76398

### Задание 10

Реализовать кодирование длин серий (Run-length encoding). Дан вектор x. Необходимо вернуть кортеж из
двух векторов одинаковой длины. Первый содержит числа, а второй - сколько раз их нужно повторить.

Пример: `x = np.array([2, 2, 2, 3, 3, 3, 5])`. 

Ответ: `(np.array([2, 3, 5]), np.array([3, 3, 1]))`.

Позаимствовали задание [отсюда](http://www.machinelearning.ru/wiki/images/5/58/MMP_Practicum_317_2015_1.pdf).

В форму можно отправить код. Проверяться он не будет, просто поделитесь с нами своим решением :) 

Для проверки своей работы можно придумать несколько тестов, как в примере.